fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ОбновитьДиаграммуГанта(Адрес, Год)
	НачалоГода = ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрШаблон("01.01.%1",Формат(Год,"ЧГ=")));  
	КонецГода = ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрШаблон("31.12.%1",Формат(Год,"ЧГ=")));
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода, КонецГода);
	
	Диаграмма.Очистить();
	
	ТД = ПолучитьИзВременногоХранилища(Адрес); 	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	
	Для Каждого Отпускник Из ТД Цикл
		
		Точка = Диаграмма.УстановитьТочку(Отпускник.Сотрудник);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Отпускник.ДатаНачала;
		Интервал.Конец = Отпускник.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 

	ОбновитьДиаграммуГанта(Параметры.Адрес, Параметры.Год)
КонецПроцедуры
